test/test_braintree/test_data/subscription_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<subscriptions type="collection">
  <current-page-number type="integer">1</current-page-number>
  <page-size type="integer">50</page-size>
  <total-items type="integer">2</total-items>
<subscription>
  <add-ons type="array"/>
  <balance>0.00</balance>
  <billing-day-of-month type="integer">22</billing-day-of-month>
  <billing-period-end-date type="date">2022-09-21</billing-period-end-date>
  <billing-period-start-date type="date">2022-08-22</billing-period-start-date>
  <created-at type="datetime">2022-08-23T03:30:00Z</created-at>
  <updated-at type="datetime">2022-08-23T03:30:00Z</updated-at>
  <current-billing-cycle type="integer">1</current-billing-cycle>
  <days-past-due nil="true"/>
  <discounts type="array"/>
  <failure-count type="integer">0</failure-count>
  <first-billing-date type="date">2022-08-22</first-billing-date>
  <id>aabbcc</id>
  <merchant-account-id>ExampleOrg_instant</merchant-account-id>
  <never-expires type="boolean">true</never-expires>
  <next-bill-amount>10.00</next-bill-amount>
  <next-billing-period-amount>10.00</next-billing-period-amount>
  <next-billing-date type="date">2022-09-22</next-billing-date>
  <number-of-billing-cycles nil="true"/>
  <paid-through-date type="date">2022-09-21</paid-through-date>
  <payment-method-token>ptoken1</payment-method-token>
  <plan-id>monthly</plan-id>
  <price>10.00</price>
  <status>Active</status>
  <trial-duration nil="true"/>
  <trial-duration-unit>day</trial-duration-unit>
  <trial-period type="boolean">false</trial-period>
  <descriptor>
    <name nil="true"/>
    <phone nil="true"/>
    <url nil="true"/>
  </descriptor>
  <description nil="true"/>
  <transactions type="array">
    <transaction>
      <id>t1234abcd</id>
      <status>settled</status>
      <type>sale</type>
      <currency-iso-code>USD</currency-iso-code>
      <amount>10.00</amount>
      <amount-requested nil="true"/>
      <merchant-account-id>ExampleOrg_instant</merchant-account-id>
      <sub-merchant-account-id nil="true"/>
      <master-merchant-account-id nil="true"/>
      <order-id nil="true"/>
      <created-at type="datetime">2022-08-23T03:29:58Z</created-at>
      <updated-at type="datetime">2022-08-23T07:30:00Z</updated-at>
      <customer>
        <id>999999</id>
        <first-name>Example</first-name>
        <last-name>Customer</last-name>
        <company nil="true"/>
        <email>example.customer@example.com</email>
        <website nil="true"/>
        <phone nil="true"/>
        <fax nil="true"/>
        <global-id>gcaaaaa11112222</global-id>
      </customer>
      <billing>
        <id>aa</id>
        <first-name nil="true"/>
        <last-name nil="true"/>
        <company nil="true"/>
        <street-address>123 Main Street</street-address>
        <extended-address nil="true"/>
        <locality>City</locality>
        <region>MA</region>
        <postal-code>55555</postal-code>
        <country-name>United States of America</country-name>
        <country-code-alpha2>US</country-code-alpha2>
        <country-code-alpha3>USA</country-code-alpha3>
        <country-code-numeric>840</country-code-numeric>
      </billing>
      <refund-id nil="true"/>
      <refund-ids type="array"/>
      <refunded-transaction-id nil="true"/>
      <partial-settlement-transaction-ids type="array"/>
      <authorized-transaction-id nil="true"/>
      <settlement-batch-id>2022-08-23_exampleorg_sb123</settlement-batch-id>
      <shipping>
        <id nil="true"/>
        <first-name nil="true"/>
        <last-name nil="true"/>
        <company nil="true"/>
        <street-address nil="true"/>
        <extended-address nil="true"/>
        <locality nil="true"/>
        <region nil="true"/>
        <postal-code nil="true"/>
        <country-name nil="true"/>
        <country-code-alpha2 nil="true"/>
        <country-code-alpha3 nil="true"/>
        <country-code-numeric nil="true"/>
      </shipping>
      <custom-fields/>
      <account-funding-transaction type="boolean">false</account-funding-transaction>
      <avs-error-response-code nil="true"/>
      <avs-postal-code-response-code>M</avs-postal-code-response-code>
      <avs-street-address-response-code>M</avs-street-address-response-code>
      <cvv-response-code>I</cvv-response-code>
      <gateway-rejection-reason nil="true"/>
      <processor-authorization-code>111111</processor-authorization-code>
      <processor-response-code>1000</processor-response-code>
      <processor-response-text>Approved</processor-response-text>
      <additional-processor-response nil="true"/>
      <voice-referral-number nil="true"/>
      <purchase-order-number nil="true"/>
      <tax-amount nil="true"/>
      <tax-exempt type="boolean">false</tax-exempt>
      <sca-exemption-requested nil="true"/>
      <processed-with-network-token type="boolean">false</processed-with-network-token>
      <credit-card>
        <token>t123</token>
        <bin>999</bin>
        <last-4>5555</last-4>
        <card-type>American Express</card-type>
        <expiration-month>12</expiration-month>
        <expiration-year>2022</expiration-year>
        <customer-location>US</customer-location>
        <cardholder-name nil="true"/>
        <image-url>https://assets.braintreegateway.com/payment_method_logo/american_express.png?environment=production</image-url>
        <prepaid>Unknown</prepaid>
        <healthcare>Unknown</healthcare>
        <debit>No</debit>
        <durbin-regulated>Unknown</durbin-regulated>
        <commercial>No</commercial>
        <payroll>Unknown</payroll>
        <issuing-bank>American Express</issuing-bank>
        <country-of-issuance>USA</country-of-issuance>
        <product-id>Unknown</product-id>
        <global-id>gcc111</global-id>
        <account-type nil="true"/>
        <unique-number-identifier>fff000fff</unique-number-identifier>
        <venmo-sdk type="boolean">false</venmo-sdk>
        <account-balance nil="true"/>
      </credit-card>
      <status-history type="array">
        <status-event>
          <timestamp type="datetime">2022-08-23T03:30:00Z</timestamp>
          <status>authorized</status>
          <amount>10.00</amount>
          <user>user_123</user>
          <transaction-source>recurring</transaction-source>
        </status-event>
        <status-event>
          <timestamp type="datetime">2022-08-23T03:30:00Z</timestamp>
          <status>submitted_for_settlement</status>
          <amount>10.00</amount>
          <user>user_123</user>
          <transaction-source>recurring</transaction-source>
        </status-event>
        <status-event>
          <timestamp type="datetime">2022-08-23T07:30:00Z</timestamp>
          <status>settled</status>
          <amount>10.00</amount>
          <transaction-source></transaction-source>
        </status-event>
      </status-history>
      <plan-id>monthly</plan-id>
      <subscription-id>7bst8j</subscription-id>
      <subscription>
        <billing-period-end-date type="date">2022-09-21</billing-period-end-date>
        <billing-period-start-date type="date">2022-08-22</billing-period-start-date>
      </subscription>
      <add-ons type="array"/>
      <discounts type="array"/>
      <descriptor>
        <name nil="true"/>
        <phone nil="true"/>
        <url nil="true"/>
      </descriptor>
      <recurring type="boolean">true</recurring>
      <channel nil="true"/>
      <service-fee-amount nil="true"/>
      <escrow-status nil="true"/>
      <disbursement-details>
        <disbursement-date nil="true"/>
        <settlement-amount nil="true"/>
        <settlement-currency-iso-code nil="true"/>
        <settlement-currency-exchange-rate nil="true"/>
        <settlement-base-currency-exchange-rate nil="true"/>
        <funds-held nil="true"/>
        <success nil="true"/>
      </disbursement-details>
      <disputes type="array"/>
      <authorization-adjustments type="array"/>
      <payment-instrument-type>credit_card</payment-instrument-type>
      <processor-settlement-response-code>4000</processor-settlement-response-code>
      <processor-settlement-response-text>Confirmed</processor-settlement-response-text>
      <network-response-code>000</network-response-code>
      <network-response-text>Approved</network-response-text>
      <three-d-secure-info nil="true"/>
      <ships-from-postal-code nil="true"/>
      <shipping-amount nil="true"/>
      <discount-amount nil="true"/>
      <network-transaction-id>00556677</network-transaction-id>
      <processor-response-type>approved</processor-response-type>
      <authorization-expires-at type="datetime">2022-08-30T03:30:00Z</authorization-expires-at>
      <retry-ids type="array"/>
      <retried-transaction-id nil="true"/>
      <refund-global-ids type="array"/>
      <partial-settlement-transaction-global-ids type="array"/>
      <refunded-transaction-global-id nil="true"/>
      <authorized-transaction-global-id nil="true"/>
      <global-id>gtrabcd</global-id>
      <retry-global-ids type="array"/>
      <retried-transaction-global-id nil="true"/>
      <retrieval-reference-number nil="true"/>
      <installment-count nil="true"/>
      <installments type="array"/>
      <refunded-installments type="array"/>
      <response-emv-data nil="true"/>
      <acquirer-reference-number nil="true"/>
      <merchant-identification-number>1111</merchant-identification-number>
      <terminal-identification-number>00000001</terminal-identification-number>
      <merchant-name>EXAMPLE ORGANIZATION</merchant-name>
      <merchant-address>
        <street-address nil="true"/>
        <locality>BigCity</locality>
        <region>CA</region>
        <postal-code>00001</postal-code>
        <phone>9175555555</phone>
      </merchant-address>
      <pin-verified type="boolean">false</pin-verified>
      <debit-network nil="true"/>
      <processing-mode nil="true"/>
      <payment-receipt>
        <id>receipt1</id>
        <global-id>greceipt1</global-id>
        <amount>10.00</amount>
        <currency-iso-code>USD</currency-iso-code>
        <processor-response-code>1000</processor-response-code>
        <processor-response-text>Approved</processor-response-text>
        <processor-authorization-code>111111</processor-authorization-code>
        <merchant-name>EXAMPLE ORGANIZATION</merchant-name>
        <merchant-address>
          <street-address nil="true"/>
          <locality>BigCity</locality>
          <region>CA</region>
          <postal-code>00001</postal-code>
          <phone>9175555555</phone>
        </merchant-address>
        <merchant-identification-number>1111</merchant-identification-number>
        <terminal-identification-number>00000001</terminal-identification-number>
        <type>sale</type>
        <pin-verified type="boolean">false</pin-verified>
        <processing-mode nil="true"/>
        <network-identification-code nil="true"/>
        <card-type>American Express</card-type>
        <card-last-4>5555</card-last-4>
        <account-balance nil="true"/>
      </payment-receipt>
    </transaction>
  </transactions>
  <status-history type="array">
    <status-event>
      <timestamp type="datetime">2022-08-23T03:30:00Z</timestamp>
      <status>Active</status>
      <user>user_123</user>
      <subscription-source>api</subscription-source>
      <balance>0.00</balance>
      <price>10.00</price>
      <currency-iso-code>USD</currency-iso-code>
      <plan-id>monthly</plan-id>
    </status-event>
  </status-history>
</subscription>
<subscription>
  <add-ons type="array"/>
  <balance>0.00</balance>
  <billing-day-of-month type="integer">22</billing-day-of-month>
  <billing-period-end-date type="date">2022-09-21</billing-period-end-date>
  <billing-period-start-date type="date">2022-08-22</billing-period-start-date>
  <created-at type="datetime">2022-08-23T03:49:39Z</created-at>
  <updated-at type="datetime">2022-08-23T03:49:39Z</updated-at>
  <current-billing-cycle type="integer">1</current-billing-cycle>
  <days-past-due nil="true"/>
  <discounts type="array"/>
  <failure-count type="integer">0</failure-count>
  <first-billing-date type="date">2022-08-22</first-billing-date>
  <id>1a2b3c</id>
  <merchant-account-id>ExampleOrg_instant</merchant-account-id>
  <never-expires type="boolean">true</never-expires>
  <next-bill-amount>25.00</next-bill-amount>
  <next-billing-period-amount>25.00</next-billing-period-amount>
  <next-billing-date type="date">2022-09-22</next-billing-date>
  <number-of-billing-cycles nil="true"/>
  <paid-through-date type="date">2022-09-21</paid-through-date>
  <payment-method-token>ptoken2</payment-method-token>
  <plan-id>monthly</plan-id>
  <price>25.00</price>
  <status>Active</status>
  <trial-duration nil="true"/>
  <trial-duration-unit>day</trial-duration-unit>
  <trial-period type="boolean">false</trial-period>
  <descriptor>
    <name nil="true"/>
    <phone nil="true"/>
    <url nil="true"/>
  </descriptor>
  <description nil="true"/>
  <transactions type="array">
    <transaction>
      <id>t5678efgh</id>
      <status>settled</status>
      <type>sale</type>
      <currency-iso-code>USD</currency-iso-code>
      <amount>25.00</amount>
      <amount-requested nil="true"/>
      <merchant-account-id>ExampleOrg_instant</merchant-account-id>
      <sub-merchant-account-id nil="true"/>
      <master-merchant-account-id nil="true"/>
      <order-id nil="true"/>
      <created-at type="datetime">2022-08-23T04:00:05Z</created-at>
      <updated-at type="datetime">2022-08-23T07:30:00Z</updated-at>
      <customer>
        <id>222222</id>
        <first-name>Another</first-name>
        <last-name>Fakename</last-name>
        <company nil="true"/>
        <email>another.fakename@example.com</email>
        <website nil="true"/>
        <phone nil="true"/>
        <fax nil="true"/>
        <global-id>gcust2222</global-id>
      </customer>
      <billing>
        <id>bb</id>
        <first-name nil="true"/>
        <last-name nil="true"/>
        <company nil="true"/>
        <street-address>1000 Vin Scully Ave</street-address>
        <extended-address nil="true"/>
        <locality>Los Angeles</locality>
        <region>CA</region>
        <postal-code>90012</postal-code>
        <country-name>United States of America</country-name>
        <country-code-alpha2>US</country-code-alpha2>
        <country-code-alpha3>USA</country-code-alpha3>
        <country-code-numeric>840</country-code-numeric>
      </billing>
      <refund-id nil="true"/>
      <refund-ids type="array"/>
      <refunded-transaction-id nil="true"/>
      <partial-settlement-transaction-ids type="array"/>
      <authorized-transaction-id nil="true"/>
      <settlement-batch-id>2022-08-23_exampleorg_sb123</settlement-batch-id>
      <shipping>
        <id nil="true"/>
        <first-name nil="true"/>
        <last-name nil="true"/>
        <company nil="true"/>
        <street-address nil="true"/>
        <extended-address nil="true"/>
        <locality nil="true"/>
        <region nil="true"/>
        <postal-code nil="true"/>
        <country-name nil="true"/>
        <country-code-alpha2 nil="true"/>
        <country-code-alpha3 nil="true"/>
        <country-code-numeric nil="true"/>
      </shipping>
      <custom-fields/>
      <account-funding-transaction type="boolean">false</account-funding-transaction>
      <avs-error-response-code nil="true"/>
      <avs-postal-code-response-code>M</avs-postal-code-response-code>
      <avs-street-address-response-code>M</avs-street-address-response-code>
      <cvv-response-code>I</cvv-response-code>
      <gateway-rejection-reason nil="true"/>
      <processor-authorization-code>222222</processor-authorization-code>
      <processor-response-code>1000</processor-response-code>
      <processor-response-text>Approved</processor-response-text>
      <additional-processor-response nil="true"/>
      <voice-referral-number nil="true"/>
      <purchase-order-number nil="true"/>
      <tax-amount nil="true"/>
      <tax-exempt type="boolean">false</tax-exempt>
      <sca-exemption-requested nil="true"/>
      <processed-with-network-token type="boolean">false</processed-with-network-token>
      <credit-card>
        <token>t456</token>
        <bin>888</bin>
        <last-4>8888</last-4>
        <card-type>MasterCard</card-type>
        <expiration-month>10</expiration-month>
        <expiration-year>2025</expiration-year>
        <customer-location>US</customer-location>
        <cardholder-name nil="true"/>
        <image-url>https://assets.braintreegateway.com/payment_method_logo/american_express.png?environment=production</image-url>
        <prepaid>Unknown</prepaid>
        <healthcare>Unknown</healthcare>
        <debit>No</debit>
        <durbin-regulated>Unknown</durbin-regulated>
        <commercial>No</commercial>
        <payroll>Unknown</payroll>
        <issuing-bank>MasterCard</issuing-bank>
        <country-of-issuance>USA</country-of-issuance>
        <product-id>Unknown</product-id>
        <global-id>gcc222</global-id>
        <account-type nil="true"/>
        <unique-number-identifier>bbb888bbb</unique-number-identifier>
        <venmo-sdk type="boolean">false</venmo-sdk>
        <account-balance nil="true"/>
      </credit-card>
      <status-history type="array">
        <status-event>
          <timestamp type="datetime">2022-08-23T04:00:06Z</timestamp>
          <status>authorized</status>
          <amount>25.00</amount>
          <user>user_123</user>
          <transaction-source>recurring</transaction-source>
        </status-event>
        <status-event>
          <timestamp type="datetime">2022-08-23T04:00:06Z</timestamp>
          <status>submitted_for_settlement</status>
          <amount>25.00</amount>
          <user>user_123</user>
          <transaction-source>recurring</transaction-source>
        </status-event>
        <status-event>
          <timestamp type="datetime">2022-08-23T07:30:00Z</timestamp>
          <status>settled</status>
          <amount>25.00</amount>
          <transaction-source></transaction-source>
        </status-event>
      </status-history>
      <plan-id>monthly</plan-id>
      <subscription-id>dh63m8</subscription-id>
      <subscription>
        <billing-period-end-date type="date">2022-09-21</billing-period-end-date>
        <billing-period-start-date type="date">2022-08-22</billing-period-start-date>
      </subscription>
      <add-ons type="array"/>
      <discounts type="array"/>
      <descriptor>
        <name nil="true"/>
        <phone nil="true"/>
        <url nil="true"/>
      </descriptor>
      <recurring type="boolean">true</recurring>
      <channel nil="true"/>
      <service-fee-amount nil="true"/>
      <escrow-status nil="true"/>
      <disbursement-details>
        <disbursement-date nil="true"/>
        <settlement-amount nil="true"/>
        <settlement-currency-iso-code nil="true"/>
        <settlement-currency-exchange-rate nil="true"/>
        <settlement-base-currency-exchange-rate nil="true"/>
        <funds-held nil="true"/>
        <success nil="true"/>
      </disbursement-details>
      <disputes type="array"/>
      <authorization-adjustments type="array"/>
      <payment-instrument-type>credit_card</payment-instrument-type>
      <processor-settlement-response-code>4000</processor-settlement-response-code>
      <processor-settlement-response-text>Confirmed</processor-settlement-response-text>
      <network-response-code>00</network-response-code>
      <network-response-text>Approved or completed successfully</network-response-text>
      <three-d-secure-info nil="true"/>
      <ships-from-postal-code nil="true"/>
      <shipping-amount nil="true"/>
      <discount-amount nil="true"/>
      <network-transaction-id>NTID2</network-transaction-id>
      <processor-response-type>approved</processor-response-type>
      <authorization-expires-at type="datetime">2022-08-30T03:49:38Z</authorization-expires-at>
      <retry-ids type="array"/>
      <retried-transaction-id nil="true"/>
      <refund-global-ids type="array"/>
      <partial-settlement-transaction-global-ids type="array"/>
      <refunded-transaction-global-id nil="true"/>
      <authorized-transaction-global-id nil="true"/>
      <global-id>gtrbbbb</global-id>
      <retry-global-ids type="array"/>
      <retried-transaction-global-id nil="true"/>
      <retrieval-reference-number nil="true"/>
      <installment-count nil="true"/>
      <installments type="array"/>
      <refunded-installments type="array"/>
      <response-emv-data nil="true"/>
      <acquirer-reference-number nil="true"/>
      <merchant-identification-number>1111</merchant-identification-number>
      <terminal-identification-number>00000001</terminal-identification-number>
      <merchant-name>EXAMPLE ORGANIZATION</merchant-name>
      <merchant-address>
        <street-address nil="true"/>
        <locality>BigCity</locality>
        <region>CA</region>
        <postal-code>00001</postal-code>
        <phone>9175555555</phone>
      </merchant-address>
      <pin-verified type="boolean">false</pin-verified>
      <debit-network nil="true"/>
      <processing-mode nil="true"/>
      <payment-receipt>
        <id>receipt1</id>
        <global-id>greceipt2</global-id>
        <amount>25.00</amount>
        <currency-iso-code>USD</currency-iso-code>
        <processor-response-code>1000</processor-response-code>
        <processor-response-text>Approved</processor-response-text>
        <processor-authorization-code>222222</processor-authorization-code>
        <merchant-name>EXAMPLE ORGANIZATION</merchant-name>
        <merchant-address>
          <street-address nil="true"/>
          <locality>BigCity</locality>
          <region>CA</region>
          <postal-code>00001</postal-code>
          <phone>9175555555</phone>
        </merchant-address>
        <merchant-identification-number>1111</merchant-identification-number>
        <terminal-identification-number>00000001</terminal-identification-number>
        <type>sale</type>
        <pin-verified type="boolean">false</pin-verified>
        <processing-mode nil="true"/>
        <network-identification-code nil="true"/>
        <card-type>MasterCard</card-type>
        <card-last-4>9287</card-last-4>
        <account-balance nil="true"/>
      </payment-receipt>
    </transaction>
  </transactions>
  <status-history type="array">
    <status-event>
      <timestamp type="datetime">2022-08-23T04:00:07Z</timestamp>
      <status>Active</status>
      <user>user_123</user>
      <subscription-source>api</subscription-source>
      <balance>0.00</balance>
      <price>25.00</price>
      <currency-iso-code>USD</currency-iso-code>
      <plan-id>monthly</plan-id>
    </status-event>
  </status-history>
</subscription>
</subscriptions>
